Revit 2027 API
WireSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As WireSetIterator
public:
virtual WireSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> WireSetIterator
override ReverseIterator : unit -> WireSetIterator
Return Value
WireSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace